import React from 'react';
import { Demo } from 'demo';
import { Divider, Typography } from '@ubt/udesign-ui';

export default function DividerPage() {
  return (
    <>
      <Demo.Page title='Divider分割线' description='区隔内容的分割线。'>
        <Demo.Block
          title='何时使用'
          description={
            <>
              *对不同章节的文本段落进行分割。
              <br />
              *对行内文字/链接进行分割，例如表格的操作列。
            </>
          }
        ></Demo.Block>
        <Demo.Block title='水平分割线' description='默认为水平分割线，可在中间加入文字。'>
          <p>
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
          </p>
          <Divider />
          <p>
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
          </p>
          <Divider dashed />
          <p>
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
          </p>
        </Demo.Block>
        <Demo.Block
          title='分割文字使用正文样式'
          description={
            <>
              使用<Typography.Text code>plain</Typography.Text>可以设置为更轻量的分割文字样式。
            </>
          }
        >
          <p>
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
          </p>
          <Divider plain>Text</Divider>
          <p>
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
          </p>
          <Divider plain orientation='left'>
            Left Text
          </Divider>
          <p>
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
          </p>
          <Divider plain orientation='right'>
            Right Text
          </Divider>
          <p>
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
          </p>
        </Demo.Block>
        <Demo.Block
          title='带文字的分割线'
          description={
            <>
              分割线中带有文字，可以用<span>orientation</span>指定文字位置。
            </>
          }
        >
          <p>
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
          </p>
          <Divider>Text</Divider>
          <p>
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
          </p>
          <Divider orientation='left'>Left Text</Divider>
          <p>
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
          </p>
          <Divider orientation='right'>Right Text</Divider>
          <p>
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
          </p>
          <Divider orientation='left' orientationMargin={50}>
            Left Text with 50px orientationMargin
          </Divider>
          <p>
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
          </p>
          <Divider orientation='right' orientationMargin={50}>
            Right Text with 50px orientationMargin
          </Divider>
          <p>
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
            这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案， 这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案这是一段待编辑的文案。
          </p>
        </Demo.Block>
        <Demo.Block
          title='垂直分割线'
          description={
            <>
              使用<span>{`type="vertical"`}</span>设置为行内的垂直分割线。
            </>
          }
        >
          Text
          <Divider type='vertical' />
          <a href=''>Link</a>
          <Divider type='vertical' />
          <a href=''>Link</a>
        </Demo.Block>
      </Demo.Page>
    </>
  );
}
